<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4ef0ea059c6b19d912f079646a5cc9fd4acd1e8d1ca15e866389e0210f6ce807","plan_job_ref":"Job Create terraform plan #105 at https://github.com/presentium/infrastructure/actions/runs/10656073220","plan_out_hash":"a8e5646bb529247ef27e7332a1ed1304f7205c23f5ef9f0600460536bea9b828","plan_hash":"d4066b42cb0cac2e51d2b4159446e4421e8203c0461981d72883b3797d6f862c","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.iam.aws_iam_user_login_profile.login["Lea"] is tainted, so must be replaced
-/+ resource "aws_iam_user_login_profile" "login" {
+       encrypted_password      = (known after apply)
!~      id                      = "***" -> (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_reset_required = (known after apply)
!~      pgp_key                 = "***************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************"
#        (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  iam_users             = {
!~      Lea        = "wcFMA9jYz27SnaN8AQ//bU+rwTu+l2L+3NnqGmF2dPHNjJA793P/PNFlDX7GZggzWJqkhYW4cfqrSm7o1J1+T2XgkfWGVV+9BPAMmK+4rg5lVG6I03CXS+HLAJG2FkdYCdQZoJ7ZiN00F6TblWbBeX1pwVJ2UHMF9FdwCwsTvLDmHfpZnpl5nth6vF9rb1j9AE0X3RUjI9hVn6GAxIhINKUTcDQtUV4eE+rc3HnO6jk5UO1S+xQbkd3LNurePG+KaWeQXmRaaDpTajXrNXfp4qGbnsstBwZLzCLrtp6xt7IoMmr4HIhSlerXDQ3ktTH1SYLqecbNbvveqj0HHcjNoF7KtBSWs9iTZUsQ0gWCrka31Pm2GXLS96LwlJwGCVfpnDyAMy7uBPjQriywuXT8+zmu1EbzcxbhO8B2iohyRXLRjW0oZLtIX/8HNWNXGoK1IkhmAnnOQ9oN6YcgifkciD+n/eWXIEvOlPiiJl6ZmQ4tYJd4EtoSTZdlCk8olCIugW06bivKLoKWC0qabnLc4bB+imyxbGixqS9P0LrO/chQW7Q7dg4U5obN5vQ83xzP4hU3jk1J+Za9BW0uRTmUdEjZgIFh8dg7HjPNyh80+tVQEHgqHJwqXKCfoD+hQ9YKlgJcjng9PhxPlQ5xwHe03U1uRo7mCFceR3QEB5fYp0ICaUBpwu5tEFguw0lbI6HSRQGkDwHxDlY8fSoNl4oJQJK0bwvEZU+XF5gKdjpOi57BtPlBslGULyj42IXyTJ5Plp4/QcZtSeent6YE+BfcBSZxf793pQ==" -> (known after apply)
#        (4 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Create terraform plan #105](https://github.com/presentium/infrastructure/actions/runs/10656073220)